#!/bin/bash

echo "Введите вашу массу (в кг, например: 70):"
read WEIGHT

echo "Введите ваш рост (в метрах, например: 1.75):"
read HEIGHT

BMI=$(echo "scale=0; $WEIGHT / ($HEIGHT * $HEIGHT)" | bc)

echo "-----------------------------------"
echo "Ваш индекс массы тела (ИМТ): $BMI"
echo "-----------------------------------"

if [ $BMI -lt 18.5 ]; then
    echo "Диагноз: Дефицит массы тела"
elif [ $BMI -lt 25 ]; then
    echo "Диагноз: Нормальная масса тела"
elif [ $BMI -lt 30 ]; then
    echo "Диагноз: Избыточная масса тела (предожирение)"
else
    echo "Диагноз: Ожирение"
fi
